Repository: wescamp/Age_of_Tentacles-1.10
Catalog: po/*.po
Languages: hu, uk

source: Age of Tentacles
hu: Csáposok kora
uk: Вік Щупалець

source: Elements of nature
hu: A természet lényei
uk: Елементи природи

source: Random Default
hu: Alapértelmezett beállítások
uk: Випадково Типово

source: Random
hu: Véletlen
uk: Випадково

source: chameleon
hu: kaméleon
uk: хамелеон

source: female^chameleon
hu: nőstény kaméleon
uk: хамелеонка

source: Chameleon: The unit can change its color like a chameleon. Enemy units cannot see this unit when it's standing on place, except if they have units next to it. Any enemy unit that first discovers this unit immediately loses all its remaining movement.
hu: Kaméleon: Az egység képes úgy változtatni a színét, mint egy kaméleon. Megjegyzés: ez az egység a rajtaütés képességével láthatatlan az ellenség számára, hacsak nem áll közvetlenül mellette, vagy nem fedi fel magát azzal, hogy támad. Az az egység, amely először fedi fel, azonnal elveszti a hátralévő lépéseit.
uk: Хамелеон: Боєць може змінювати свій колір, як хамелеон. Ворожі бійці не можуть бачити цього бійця, за винятком, якщо вони зняходяться поряд з ним. Ворог, який першим виявить цього бійця, відразу втрачає всі невитрачені рухи.

source: Chameleon!
hu: Egy kaméleon!
uk: Хамелеон!

source: infection
hu: ragály
uk: Інфекція

source: Infection: This attack infects living targets. Infected units lose 8 HP every turn until the plague destroy their mind and body, turning them into walking mindless bodies.
hu: Ragály: Ez a támadás megfertőzi az élő ellenfeleket. Egy fertőzött egység minden körben 8 ÉP-t veszít, amíg a ragály el nem pusztítja az elméjüket és a testüket, eleven testekké változtatva őket.

source: infected: This unit is infected. It will lose 8 hp every turn and will be turned into zombie after death.
hu: Fertőzött: ez az egység megfertőződött. Minden körben 8 ÉP-t veszít, amíg végül meghal és eleven testté válik.
uk: інфікований: Цей боєць інфікований. Він втрачатиме 8 зд кожен хід і буде перетворений на зомбі після смерті.

source: female^infected
hu: fertőzött
uk: інфікована

source: infected
hu: fertőzött
uk: інфікований

source: This unit is able to change color of its skin, hiding from enemy.
hu: Ez az egység képes megváltoztatni a színét, így rejtőzve el az ellenség elől.
uk: Цей боєць здатний змінювати колір шкіри, приховуючись від ворога.

source: The units, infected by this unit will continually take damage until they lose all their hitpoints at which point, they get turned into walking corpses.
hu: Azok az ellenségek, amelyek ettől az egységtől fertőződtek meg, folyamatosan sebződni fognak, amíg el nem vesztik minden életerejüket és átváltoznak eleven testekké.
uk: Бійці, інфіковані цим бійцем, будуть безупинно отримувати ушкодження поки вони не втратять усе здоров'я, і тоді перетворяться на ходячих трупів.

source: Giant Dragonfly
hu: Óriás szitakötő
uk: Гігантська бабка

source: Giant dragonflies are living relics of ancient ages, when insectoids ruled the land, just a shadow of their former greatness
hu: Az óriás szitakötők élő kövületek abból a korból, amikor rovarok uralták a földet, de ma már csak árnyékaik korábbi nagyságuknak.
uk: Велетенські бабки - це живі реліквії древніх віків, коли інсектоїди управляли землею, тільки тінь їх колишньої величі

source: mandibles
hu: csáprágó
uk: нижні щелепи

source: Giant Mosquito
hu: Óriás moszkító
uk: Гігантський москіт

source: Some mosquitos in these tropical swamps grow to giant sizes and may be quite dangerous for weak units if there are too many of them.
hu: Néhány moszkító ezekben a trópusi mocsarakban óriási méretűre nőtt és nagy számban támadva komoly veszélyt jelenthetnek a gyenge egységekre.
uk: Деякі москіти в цих тропічних болотах доростають до велетенських розмірів і можуть бути дуже небезпечні для слабких бійців, якщо їх є занадто багато.

source: proboscis
hu: szívószáj
uk: хоботок

source: Plague Mosquito
hu: Pestis moszkító
uk: Чумний москіт

source: When venomous mosquitos drink blood of infected animals, they turn into plague mosquitos, possibly the worst thing, you may encounter in the tropical swamps. Infection they carry is very hard to cure and can turn its victim into a walking mindless body in a matter of few days.
hu: Amikor a mérgező moszkítók fertőzött vérű állatok vérét szívják, pestis-moszkítókká válnak, talán a legszörnyűbb lénnyé, amivel találkozhatsz a trópusi mocsarakban. A fertőzés, amit hordoznak, nem gyógyítható és az áldozatok pár nap alatt agyatlan eleven testekké válnak.
uk: Коли отруйні москіти п'ють кров заражених тварин, вони перетворюються на чумних москітів, напевне найгірше, з чим ви можете зіткнутися в тропічних болотах. Інфекцію, яку вони розносять, дуже важко вилікувати, і вона може перетворити свою жертву на тупого ходячого трупа в лічені дні.

source: infected spike
hu: mérgezett tüske
uk: інфікований шип

source: Venom Mosquito
hu: Mérges moszkító
uk: Отруйний москіт

source: These venomous mosquitos are disaster for ones who dare to enter swamps where they live. They are not mosquitos actually, but similar insects, learned to shoot chitinous spikes throught their proboscises. They can either poison their victims, or drink blood of them.
hu: Ezek a mérgező moszkítók katasztrófálisak azok számára, akik be mernek lépni a mocsarakba, ahol élnek. Tulajdonképpen nem moszkítók, de szintén rovarok. Megtanulták, hogyan lőhetnek kitintüskéket a szívószájukon át. Meg is tudják mérgezni az áldozataikat, vagy vért szívnak tőlük.
uk: Ці отруйні москіти є лихом для тих, хто наважиться увійти в їх болота. Насправді вони не москіти, але дуже на них подібні комахи, навчені стріляти хітиновими шипами через їх хоботки. Вони можуть отруювати своїх жертв, або пити з них кров.

source: venom injection
hu: méreg injekció
uk: ін'єкція отрути

source: venom spike
hu: mérgező tüske
uk: отруйний шип

source: Dire Shessinsaan
hu: Irtózatos Shessinsaan
uk: Жахливий шіссінсаан

source: Shessinsaans are alien semi-sentient predatory reptiles with tentacles. As shessinsaans grow older, they became stronger and even more terrifying.
hu: A Shessinsaanok idegen rovarszerű lények, tulajdonképpen ragadozó hüllők csápokkal. Ahogy idősebbé válnak, erősebbek és még szörnyűbbek lesznek.
uk: Шіссінсаани - це чужі напіврозумні хижі рептилії з щупальцями. Коли шіссінсаани ростуть, вони стають сильнішими і навіть більш жахливими.

source: tentacle
hu: csáp
uk: щупальце

source: Shessinsaans are alien semi-sentient predatory reptiles with tentacles.
hu: A Shessinsaanok idegen rovarszerű lények, csápos ragadozó hüllők.
uk: Шіссінсаани - це чужі напіврозумні хижі рептилії з щупальцями.

source: race^Shessinsaan
hu: Shessinsaan
uk: Шіссінсаан

source: race+female^Shessinsaan
hu: Shessinsaan
uk: Шіссінсаанка

source: race+plural^Shessinsaans
hu: Shessinsaanok
uk: Шіссінсаани

source: race^Insectoid
hu: Rovarszerű
uk: Інсектоїд

source: race+female^Insectoid
hu: Rovarszerű
uk: Інсектоїдка

source: race+plural^Insectoids
hu: Rovarszerűek
uk: Інсектоїди

source: Shessinsaan
uk: Шіссінсаан
